# InstOutsideFaceBoundary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..InstOutsideFaceBoundary Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Instance origin does not lie on host face. Instance will lose association to host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InstOutsideFaceBoundary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstOutsideFaceBoundary As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InstOutsideFaceBoundary {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace